[
  {
    "title": "personal",
    "text": "I have a lot of interests and hobbies that include videogaming (Dragon Age and a whole host of cozy games); running and spending time outside; watching reality TV (90-day fiance, Bachelor/ette, and a lot of other relationship shows that I can't get enough of); reading (mostly fantasy, romance, and Dragon Age fanfiction...); and D&D. I've called Minnesota home since July 2018, but I grew up overseas and have spent time in Colorado and Hawaii. I hope that at some point in my career I'll have the opportunity to work on a videogame in some capacity, and I'm hoping to pick up writing and tap dance again in the next year!"
  },
  {
    "title": "full-stack web dev bootcamp",
    "text": "The fullstack web development bootcamp hosted through the University of Minnesota has been one of the most challenging and rewarding experiences I have undertaken. In just 12 weeks, I learned, utilized, and improved upon every skill listed in my Technical Skills section in my resume (see above). Each week, I completed one to two assignments, which increased in both scope and complexity. I worked in both the client- and server-side environments, and discovered that I enjoy server-side work. I learned to read, work with, and build on provided code, as well as how to write entire projects from scratch. I collaborated on group projects, and now better understand the basics of git flow.  I have grown immensely, personally and professionally, in these three months. I look forward to continuing my developer journey!"
  },
  {
    "title": "work",
    "text": "I have spent the majority of my professional time in higher education in student-facing roles. I love working at a university, and I enjoyed my time in student affairs; however, I realized that front-of-house university work isn't as professionally fulfilling as I had hoped it would be. I'm interested in a career path that allows me to learn and/or create, and that has more opportunities for growth and development. I'm invested in higher education and would like to continue serving a university in a application or software development capacity."
  },
  {
    "title": "education",
    "text": "I earned my Bachelor's degree in Communications with a minor in Philosophy from Western Colorado University in Gunnison, CO in December 2015. After graduation, I took a break from higher education and earned my PADI Master SCUBA Diver Trainer teaching license. I taught SCUBA diving on Kauai, HI until 2018, at which point I returned to school to pursue my Master's degree in English at St. Cloud State University in St. Cloud, MN. I completed my Master's in 2020 and continued to work in higher ed. In Septmeber 2022, I decided to earn my certicate in fullstack web development from the University of Minnesota to facilitate a career change. I graduated in December 2022!"
  }
]
